Revit 2026 API

# ApplicationIsElectricalAnalysisEnabled Property

---

Checks whether or not electrical analysis is enabled, and enable or disable it.

**Namespace:** Autodesk.Revit.ApplicationServices**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsElectricalAnalysisEnabled { get; set; }
```
```vb
Public Property IsElectricalAnalysisEnabled As Boolean
	Get
	Set
```
```cpp
public:
property bool IsElectricalAnalysisEnabled {
	bool get ();
	void set (bool value);
}
```
```fsharp
member IsElectricalAnalysisEnabled : bool with get, set
```

#### Property Value

Boolean

| Exception | Condition |
| --- | --- |
| InvalidOperationException | When setting this property: The current product type is not ProductType.Revit and discipline controls are not enabled. |

Enabling electrical analysis will not take effect unless the electrical discipline is also enabled.

#### Reference

Application Class

Autodesk.Revit.ApplicationServices Namespace